unsigned char rom[] = {
  // オペレーションコードの確認
  B00000000, 
  B00010001, 
  B00100010, 
  B00110011, 
  B01000100, 
  B01010101, 
  B01100110, 
  B01110111, 
  B10001000, 
  B10011001, 
  B10101010, 
  B10111011, 
  B11001100,
  B11011101,
  B11101110,
  B11111111,
};

void setup() {
  DDRB = DDRB | B00001111;
  DDRC = DDRC | B00001111;
}

void loop() {
  // アドレス入力 D5 D4 D3 D2 番ピン（右が最下位ビット）
  // データ出力   D11 D10 D9 D8 A3 A2 A1 A0 番ピン（右が最下位ビット）
  unsigned char addr = (PIND & B00111100)>>2;

  PORTC = (PORTC & B11110000) | (rom[addr] & B00001111);
  PORTB = (PORTB & B11110000) | ((rom[addr] & B11110000)>>4);
}
